#include <stdio.h>

//二维数组就是把多个数组放到一个大数组当中
//这是真二维数组，他在内存中是连续的
int arr[2][5] =
{
    {1, 2, 3, 4, 5},
    {6, 7, 8, 9, 10}
};

//数组指针 这里的arr是指向第一行数组的指针，而这个int (*)[5]这个意思是指向有五个整数的数组的指针
int (*p)[5] = arr;

//这是指针数组
int arr1[5] = {1, 2, 3, 4, 5};
int arr2[5] = {6, 7, 8, 9, 10};
int* arr3[2] = {arr1, arr2};//指针数组
//int* 可以理解为单独的数据类型整数指针，所以arr3的定义就是这个数组当中存了两个退化成指针的两个数组

//arr3里面存的是int类型的指针
int* *q = arr3;//其实主流写法是 int **q = arr3
//数据类型 * 名字 = arr;

int main()
{
    //第一种遍历
    // for (int i = 0; i < 2; i++)
    // {
    //     for (int j = 0; j < 5; j++)
    //     {
    //         printf("%d\n", arr[i][j]);
    //     }
    // }

    // for (int i = 0; i < 2; i++)
    // {
    //     for (int j = 0; j < 5; j++)
    //     {
    //         printf("%d\n", *(*p + j));
    //     }
    //     p++;
    // }

    // for (int i = 0; i < 2; i++)
    // {
    //     for (int j = 0; j < 5; j++)
    //     {
    //         //
    //         printf("%d\n", *(*(p + i)+j));
    //     }
    // }

    //第二种数组的遍历
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            printf("%d", *(*(q+i)+j));
        }
        

    }



    return 0;
}